[0/1] Running the Clang regression tests
llvm-lit: /root/llvm-project/llvm/utils/lit/lit/llvm/config.py:509: note: using clang: /root/llvm-project/build/bin/clang
-- Testing: 22563 tests, 224 workers --
Testing: 
FAIL: Clang :: Sema/scope-check.c (1 of 22563)
******************** TEST 'Clang :: Sema/scope-check.c' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -fsyntax-only -verify -fblocks -std=gnu99 /root/llvm-project/clang/test/Sema/scope-check.c -Wno-unreachable-code
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -fsyntax-only -verify -fblocks -std=gnu99 /root/llvm-project/clang/test/Sema/scope-check.c -Wno-unreachable-code
error: 'expected-error' diagnostics seen but not expected: 
  File /root/llvm-project/clang/test/Sema/scope-check.c Line 201: initializer element is not a compile-time constant
  File /root/llvm-project/clang/test/Sema/scope-check.c Line 205: initializer element is not a compile-time constant
  File /root/llvm-project/clang/test/Sema/scope-check.c Line 222: initializer element is not a compile-time constant
3 errors generated.

--

********************
Testing: 
FAIL: Clang :: CodeGenCXX/const-init-cxx2a.cpp (2 of 22563)
******************** TEST 'Clang :: CodeGenCXX/const-init-cxx2a.cpp' FAILED ********************

#46 0x000000000c7c354a clang::CompilerInstance::ExecuteAction(clang::FrontendAction&) /root/llvm-project/clang/lib/Frontend/CompilerInstance.cpp:1062:23
#47 0x000000000ca7c9b7 clang::ExecuteCompilerInvocation(clang::CompilerInstance*) /root/llvm-project/clang/lib/FrontendTool/ExecuteCompilerInvocation.cpp:280:8
#48 0x0000000007669341 cc1_main(llvm::ArrayRef<char const*>, char const*, void*) /root/llvm-project/clang/tools/driver/cc1_main.cpp:232:13
#49 0x000000000765bd02 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:215:5
#50 0x000000000765aa5b clang_main(int, char**, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:256:5
#51 0x000000000768def5 main /root/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#52 0x00007f96dbc4614a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#53 0x00007f96dbc4620b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#54 0x000000000765a4e5 _start (/root/llvm-project/build/bin/clang+0x765a4e5)
/root/llvm-project/build/tools/clang/test/CXX/temp/temp.arg/temp.arg.nontype/Output/p1.cpp.script: line 3: 213974 Aborted                 /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -fsyntax-only -verify=expected,precxx17 -triple=x86_64-linux-gnu -std=c++14 /root/llvm-project/clang/test/CXX/temp/temp.arg/temp.arg.nontype/p1.cpp

--

********************
Testing: 
FAIL: Clang :: Sema/ms_class_layout.cpp (252 of 22563)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
/root/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /root/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing: 
FAIL: Clang :: SemaCXX/cxx2a-consteval.cpp (253 of 22563)
******************** TEST 'Clang :: SemaCXX/cxx2a-consteval.cpp' FAILED ********************
Exit Code: 134

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++2a -emit-llvm-only -Wno-unused-value -Wno-vla /root/llvm-project/clang/test/SemaCXX/cxx2a-consteval.cpp -verify
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++2a -emit-llvm-only -Wno-unused-value -Wno-vla /root/llvm-project/clang/test/SemaCXX/cxx2a-consteval.cpp -verify
