[0/1] Running the Clang regression tests
llvm-lit: /root/llvm-project/llvm/utils/lit/lit/llvm/config.py:509: note: using clang: /root/llvm-project/build/bin/clang
-- Testing: 22654 tests, 224 workers --
Testing: 
FAIL: Clang :: AST/fixed_point_to_string.c (1 of 22654)
******************** TEST 'Clang :: AST/fixed_point_to_string.c' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 2: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -ast-dump -ffixed-point /root/llvm-project/clang/test/AST/fixed_point_to_string.c | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/AST/fixed_point_to_string.c
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -ast-dump -ffixed-point /root/llvm-project/clang/test/AST/fixed_point_to_string.c
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/AST/fixed_point_to_string.c
/root/llvm-project/clang/test/AST/fixed_point_to_string.c:21:39: error: initializer element is not a compile-time constant
   21 | unsigned short _Accum u_short_accum = 0.5uhk;
      |                                       ^~~~~~
/root/llvm-project/clang/test/AST/fixed_point_to_string.c:22:27: error: initializer element is not a compile-time constant
   22 | unsigned _Accum u_accum = 0.5uk;
      |                           ^~~~~

#38 0x000000000c83ffaa clang::CompilerInstance::ExecuteAction(clang::FrontendAction&) /root/llvm-project/clang/lib/Frontend/CompilerInstance.cpp:1062:23
#39 0x000000000cafad07 clang::ExecuteCompilerInvocation(clang::CompilerInstance*) /root/llvm-project/clang/lib/FrontendTool/ExecuteCompilerInvocation.cpp:280:8
#40 0x00000000076978d1 cc1_main(llvm::ArrayRef<char const*>, char const*, void*) /root/llvm-project/clang/tools/driver/cc1_main.cpp:232:13
#41 0x000000000768a242 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:215:5
#42 0x0000000007688f9b clang_main(int, char**, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:256:5
#43 0x00000000076bc6d5 main /root/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#44 0x00007f116ac2214a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#45 0x00007f116ac2220b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#46 0x0000000007688a25 _start (/root/llvm-project/build/bin/clang+0x7688a25)
/root/llvm-project/build/tools/clang/test/SemaCXX/Output/cxx2a-consteval.cpp.script: line 1: 1560558 Aborted                 (core dumped) /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++2a -emit-llvm-only -Wno-unused-value -Wno-vla /root/llvm-project/clang/test/SemaCXX/cxx2a-consteval.cpp -verify

--

********************
Testing: 
FAIL: Clang :: Sema/ms_class_layout.cpp (163 of 22654)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp
/root/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /root/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing: 
FAIL: Clang :: AST/ast-dump-APValue-array.cpp (164 of 22654)
******************** TEST 'Clang :: AST/ast-dump-APValue-array.cpp' FAILED ********************
Exit Code: 2

Command Output (stderr):
--
RUN: at line 2: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -triple x86_64-unknown-unknown -Wno-unused-value -std=gnu++17             -ast-dump /root/llvm-project/clang/test/AST/ast-dump-APValue-array.cpp -ast-dump-filter Test  | /root/llvm-project/build/bin/FileCheck --strict-whitespace --match-full-lines /root/llvm-project/clang/test/AST/ast-dump-APValue-array.cpp
