[1/4781] Building CXX object lib/Demangle/CMakeFiles/LLVMDemangle.dir/Demangle.cpp.o
[2/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/ABIBreak.cpp.o
[3/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/AutoConvert.cpp.o
[4/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/BuryPointer.cpp.o
[5/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/COM.cpp.o
[6/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/DivisionByConstantInfo.cpp.o
[7/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/ExtensibleRTTI.cpp.o
[8/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/MemAlloc.cpp.o
[9/4781] Building C object lib/Support/CMakeFiles/LLVMSupport.dir/regerror.c.o
[10/4781] Building C object lib/Support/CMakeFiles/LLVMSupport.dir/regfree.c.o
[11/4781] Building C object lib/Support/CMakeFiles/LLVMSupport.dir/regstrlcpy.c.o
[12/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/Atomic.cpp.o
[13/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/Valgrind.cpp.o
[14/4781] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/Watchdog.cpp.o
[15/4781] Building ASM object lib/Support/BLAKE3/CMakeFiles/LLVMSupportBlake3.dir/blake3_sse2_x86-64_unix.S.o
[16/4781] Building ASM object lib/Support/BLAKE3/CMakeFiles/LLVMSupportBlake3.dir/blake3_sse41_x86-64_unix.S.o

#38 0x000000000cb7a167 clang::ExecuteCompilerInvocation(clang::CompilerInstance*) /root/llvm-project/clang/lib/FrontendTool/ExecuteCompilerInvocation.cpp:280:8
#39 0x00000000076d9651 cc1_main(llvm::ArrayRef<char const*>, char const*, void*) /root/llvm-project/clang/tools/driver/cc1_main.cpp:232:13
#40 0x00000000076cbfc2 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:215:5
#41 0x00000000076cad1b clang_main(int, char**, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:256:5
#42 0x00000000076fe3e5 main /root/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#43 0x00007f727504614a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#44 0x00007f727504620b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#45 0x00000000076ca7a5 _start (/root/llvm-project/build/bin/clang+0x76ca7a5)
/root/llvm-project/build/tools/clang/test/SemaCXX/Output/constexpr-function-recovery-crash.cpp.script: line 1: 1731789 Aborted                 (core dumped) /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc /root/llvm-project/clang/test/SemaCXX/constexpr-function-recovery-crash.cpp -std=c++20 -fsyntax-only -fcxx-exceptions -verify

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90..
FAIL: Clang :: Sema/ms_class_layout.cpp (24166 of 24228)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
/root/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /root/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90..
FAIL: Clang :: SemaCXX/constant-expression.cpp (24168 of 24228)
******************** TEST 'Clang :: SemaCXX/constant-expression.cpp' FAILED ********************
Exit Code: 134

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -fsyntax-only -verify -std=c++98 -pedantic /root/llvm-project/clang/test/SemaCXX/constant-expression.cpp
