[0/1] Running the Clang regression tests
llvm-lit: /root/llvm-project/llvm/utils/lit/lit/llvm/config.py:502: note: using clang: /root/llvm-project/build/bin/clang
-- Testing: 22533 tests, 224 workers --
Testing: 
FAIL: Clang :: Sema/vector-init.c (1 of 22533)
******************** TEST 'Clang :: Sema/vector-init.c' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc /root/llvm-project/clang/test/Sema/vector-init.c -fsyntax-only -verify
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc /root/llvm-project/clang/test/Sema/vector-init.c -fsyntax-only -verify
error: 'expected-error' diagnostics seen but not expected: 
  File /root/llvm-project/clang/test/Sema/vector-init.c Line 48: initializer element is not a compile-time constant
  File /root/llvm-project/clang/test/Sema/vector-init.c Line 51: initializer element is not a compile-time constant
2 errors generated.

--

********************
Testing: 
FAIL: Clang :: CodeGen/2008-08-07-GEPIntToPtr.c (2 of 22533)
******************** TEST 'Clang :: CodeGen/2008-08-07-GEPIntToPtr.c' FAILED ********************
Exit Code: 1

Command Output (stderr):
--

#42 0x000000000c2ac2f8 clang::CodeGenAction::ExecuteAction() /root/llvm-project/clang/lib/CodeGen/CodeGenAction.cpp:1183:5
#43 0x000000000c85a2cc clang::FrontendAction::Execute() /root/llvm-project/clang/lib/Frontend/FrontendAction.cpp:1082:7
#44 0x000000000c7794aa clang::CompilerInstance::ExecuteAction(clang::FrontendAction&) /root/llvm-project/clang/lib/Frontend/CompilerInstance.cpp:1062:23
#45 0x000000000ca31b97 clang::ExecuteCompilerInvocation(clang::CompilerInstance*) /root/llvm-project/clang/lib/FrontendTool/ExecuteCompilerInvocation.cpp:278:8
#46 0x000000000763fd41 cc1_main(llvm::ArrayRef<char const*>, char const*, void*) /root/llvm-project/clang/tools/driver/cc1_main.cpp:232:13
#47 0x0000000007632702 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:215:5
#48 0x000000000763145b clang_main(int, char**, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:256:5
#49 0x00000000076648a5 main /root/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#50 0x00007f741504614a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#51 0x00007f741504620b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#52 0x0000000007630ee5 _start (/root/llvm-project/build/bin/clang+0x7630ee5)
FileCheck error: '<stdin>' is empty.
FileCheck command line:  /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/SemaCXX/constexpr-vectors.cpp

--

********************
Testing: 
FAIL: Clang :: Sema/ms_class_layout.cpp (282 of 22533)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp
/root/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /root/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing: 
FAIL: Clang :: SemaCXX/MicrosoftExtensions.cpp (283 of 22533)
******************** TEST 'Clang :: SemaCXX/MicrosoftExtensions.cpp' FAILED ********************
Exit Code: 134

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++17 /root/llvm-project/clang/test/SemaCXX/MicrosoftExtensions.cpp -triple i686-pc-win32 -fsyntax-only -Wmicrosoft -Wc++11-extensions -Wno-long-long -verify -fms-extensions -fexceptions -fcxx-exceptions -DTEST1
