[1/4807] Building CXX object lib/Demangle/CMakeFiles/LLVMDemangle.dir/Demangle.cpp.o
[2/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/ABIBreak.cpp.o
[3/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/AutoConvert.cpp.o
[4/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/COM.cpp.o
[5/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/DivisionByConstantInfo.cpp.o
[6/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/ExtensibleRTTI.cpp.o
[7/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/MemAlloc.cpp.o
[8/4807] Building C object lib/Support/CMakeFiles/LLVMSupport.dir/regerror.c.o
[9/4807] Building C object lib/Support/CMakeFiles/LLVMSupport.dir/regfree.c.o
[10/4807] Building C object lib/Support/CMakeFiles/LLVMSupport.dir/regstrlcpy.c.o
[11/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/Atomic.cpp.o
[12/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/Valgrind.cpp.o
[13/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/Watchdog.cpp.o
[14/4807] Building CXX object lib/Support/CMakeFiles/LLVMSupport.dir/BuryPointer.cpp.o
[15/4807] Building ASM object lib/Support/BLAKE3/CMakeFiles/LLVMSupportBlake3.dir/blake3_sse2_x86-64_unix.S.o
[16/4807] Building CXX object lib/Demangle/CMakeFiles/LLVMDemangle.dir/DLangDemangle.cpp.o
[17/4807] Generating VCSRevision.h

#44 0x000000000cc94287 clang::ExecuteCompilerInvocation(clang::CompilerInstance*) /root/llvm-project/clang/lib/FrontendTool/ExecuteCompilerInvocation.cpp:280:8
#45 0x00000000077ae8d1 cc1_main(llvm::ArrayRef<char const*>, char const*, void*) /root/llvm-project/clang/tools/driver/cc1_main.cpp:232:13
#46 0x00000000077a1242 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:215:5
#47 0x000000000779ff9b clang_main(int, char**, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:256:5
#48 0x00000000077d3645 main /root/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#49 0x00007f99b484614a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#50 0x00007f99b484620b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#51 0x000000000779fa25 _start (/root/llvm-project/build/bin/clang+0x779fa25)
/root/llvm-project/build/tools/clang/test/Sema/Output/unbounded-array-bounds.c.script: line 3: 455824 Aborted                 (core dumped) /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -triple x86_64-pc-linux-gnu -fsyntax-only -Wno-unused -verify=addr64,expected /root/llvm-project/clang/test/Sema/unbounded-array-bounds.c

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90..
FAIL: Clang :: Sema/ms_class_layout.cpp (22928 of 22972)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
/root/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /root/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90..
FAIL: Clang :: SemaCXX/constexpr-function-recovery-crash.cpp (22929 of 22972)
******************** TEST 'Clang :: SemaCXX/constexpr-function-recovery-crash.cpp' FAILED ********************
Exit Code: 134

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc /root/llvm-project/clang/test/SemaCXX/constexpr-function-recovery-crash.cpp -std=c++20 -fsyntax-only -fcxx-exceptions -verify
