[1/307] Building CXX object tools/clang/lib/Testing/CMakeFiles/clangTesting.dir/CommandLineArgs.cpp.o
[2/307] Building CXX object lib/Testing/Annotations/CMakeFiles/LLVMTestingAnnotations.dir/Annotations.cpp.o
[3/307] Linking CXX static library lib/libLLVMTestingAnnotations.a
[4/307] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/SanitizersTest.cpp.o
[5/307] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/CharInfoTest.cpp.o
[6/307] Building CXX object third-party/unittest/UnitTestMain/CMakeFiles/llvm_gtest_main.dir/TestMain.cpp.o
[7/307] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/DarwinSDKInfoTest.cpp.o
[8/307] Building CXX object tools/clang/unittests/Lex/CMakeFiles/LexTests.dir/DependencyDirectivesScannerTest.cpp.o
[9/307] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/DiagnosticTest.cpp.o
[10/307] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/FileEntryTest.cpp.o
[11/307] Building CXX object tools/clang/unittests/Driver/CMakeFiles/ClangDriverTests.dir/ModuleCacheTest.cpp.o
[12/307] Building CXX object lib/Testing/Support/CMakeFiles/LLVMTestingSupport.dir/Error.cpp.o
[13/307] Building CXX object lib/Testing/Support/CMakeFiles/LLVMTestingSupport.dir/SupportHelpers.cpp.o
[14/307] Building CXX object tools/clang/unittests/Driver/CMakeFiles/ClangDriverTests.dir/DistroTest.cpp.o

#37 0x0000000007837702 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /home/fedora/interp-tests/llvm-project/clang/tools/driver/driver.cpp:215:5
#38 0x000000000783645b clang_main(int, char**, llvm::ToolContext const&) /home/fedora/interp-tests/llvm-project/clang/tools/driver/driver.cpp:256:5
#39 0x000000000786b685 main /home/fedora/interp-tests/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#40 0x00007fafa184614a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#41 0x00007fafa184620b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#42 0x0000000007835ee5 _start (/home/fedora/interp-tests/llvm-project/build/bin/clang+0x7835ee5)
/home/fedora/interp-tests/llvm-project/build/tools/clang/test/SemaCXX/Output/constant-expression.cpp.script: line 1: 3285366 Aborted                 (core dumped) /home/fedora/interp-tests/llvm-project/build/bin/clang -cc1 -internal-isystem /home/fedora/interp-tests/llvm-project/build/lib/clang/19/include -nostdsysteminc -fsyntax-only -verify -std=c++98 -pedantic /home/fedora/interp-tests/llvm-project/clang/test/SemaCXX/constant-expression.cpp

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90
FAIL: Clang :: Sema/ms_class_layout.cpp (19642 of 20873)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /home/fedora/interp-tests/llvm-project/build/bin/clang -cc1 -internal-isystem /home/fedora/interp-tests/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /home/fedora/interp-tests/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /home/fedora/interp-tests/llvm-project/build/bin/FileCheck /home/fedora/interp-tests/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /home/fedora/interp-tests/llvm-project/build/bin/clang -cc1 -internal-isystem /home/fedora/interp-tests/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /home/fedora/interp-tests/llvm-project/clang/test/Sema/ms_class_layout.cpp
+ /home/fedora/interp-tests/llvm-project/build/bin/FileCheck /home/fedora/interp-tests/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
/home/fedora/interp-tests/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /home/fedora/interp-tests/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90
FAIL: Clang :: SemaCXX/constexpr-vectors.cpp (19643 of 20873)
******************** TEST 'Clang :: SemaCXX/constexpr-vectors.cpp' FAILED ********************
Exit Code: 2

Command Output (stderr):
--
