[1/306] Building CXX object tools/clang/lib/Testing/CMakeFiles/clangTesting.dir/CommandLineArgs.cpp.o
[2/306] Building CXX object lib/Testing/Annotations/CMakeFiles/LLVMTestingAnnotations.dir/Annotations.cpp.o
[3/306] Building CXX object tools/clang/unittests/CodeGen/CMakeFiles/ClangCodeGenTests.dir/CheckTargetFeaturesTest.cpp.o
[4/306] Linking CXX static library lib/libLLVMTestingAnnotations.a
[5/306] Building CXX object tools/clang/unittests/Format/CMakeFiles/FormatTests.dir/MatchFilePathTest.cpp.o
[6/306] Building CXX object tools/clang/unittests/Frontend/CMakeFiles/FrontendTests.dir/ParsedSourceLocationTest.cpp.o
[7/306] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/CharInfoTest.cpp.o
[8/306] Building CXX object tools/clang/unittests/Rewrite/CMakeFiles/RewriteTests.dir/RewriteBufferTest.cpp.o
[9/306] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/SanitizersTest.cpp.o
[10/306] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/DiagnosticTest.cpp.o
[11/306] Building CXX object tools/clang/unittests/Basic/CMakeFiles/BasicTests.dir/FileEntryTest.cpp.o
[12/306] Building CXX object tools/clang/unittests/Lex/CMakeFiles/LexTests.dir/DependencyDirectivesScannerTest.cpp.o
[13/306] Building CXX object tools/clang/unittests/Driver/CMakeFiles/ClangDriverTests.dir/DistroTest.cpp.o
[14/306] Building CXX object third-party/unittest/UnitTestMain/CMakeFiles/llvm_gtest_main.dir/TestMain.cpp.o

#46 0x000000000cb08bdc clang::FrontendAction::Execute() /root/llvm-project/clang/lib/Frontend/FrontendAction.cpp:1082:7
#47 0x000000000ca25229 clang::CompilerInstance::ExecuteAction(clang::FrontendAction&) /root/llvm-project/clang/lib/Frontend/CompilerInstance.cpp:1061:23
#48 0x000000000cce4437 clang::ExecuteCompilerInvocation(clang::CompilerInstance*) /root/llvm-project/clang/lib/FrontendTool/ExecuteCompilerInvocation.cpp:280:8
#49 0x00000000077d1951 cc1_main(llvm::ArrayRef<char const*>, char const*, void*) /root/llvm-project/clang/tools/driver/cc1_main.cpp:232:13
#50 0x00000000077c42c2 ExecuteCC1Tool(llvm::SmallVectorImpl<char const*>&, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:215:5
#51 0x00000000077c301b clang_main(int, char**, llvm::ToolContext const&) /root/llvm-project/clang/tools/driver/driver.cpp:256:5
#52 0x00000000077f6ad5 main /root/llvm-project/build/tools/clang/tools/driver/clang-driver.cpp:17:3
#53 0x00007fb39744614a __libc_start_call_main (/lib64/libc.so.6+0x2814a)
#54 0x00007fb39744620b __libc_start_main@GLIBC_2.2.5 (/lib64/libc.so.6+0x2820b)
#55 0x00000000077c2aa5 _start (/root/llvm-project/build/bin/clang+0x77c2aa5)
FileCheck error: '<stdin>' is empty.
FileCheck command line:  /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Rewriter/rewrite-block-literal.mm

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90..
FAIL: Clang :: Sema/ms_class_layout.cpp (22983 of 23032)
******************** TEST 'Clang :: Sema/ms_class_layout.cpp' FAILED ********************
Exit Code: 1

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp 2>/dev/null             | /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
+ /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -std=c++14 -emit-llvm-only -triple i686-pc-win32 -fdump-record-layouts /root/llvm-project/clang/test/Sema/ms_class_layout.cpp
+ /root/llvm-project/build/bin/FileCheck /root/llvm-project/clang/test/Sema/ms_class_layout.cpp --strict-whitespace
/root/llvm-project/clang/test/Sema/ms_class_layout.cpp:419:17: error: CHECK-LABEL: expected string not found in input
// CHECK-LABEL: 0 | struct EV{{$}}
                ^
<stdin>:273:23: note: scanning from here
         0 | struct DV
                      ^
<stdin>:274:10: note: possible intended match here
         0 |   struct BV (primary base)
         ^

Input file: <stdin>
Check file: /root/llvm-project/clang/test/Sema/ms_class_layout.cpp

-dump-input=help explains the following input dump.

Input was:
<<<<<<
             .
             .
             .
           268:          8 |       (AV vftable pointer) 
           269:            | [sizeof=12, align=4, 
           270:            |  nvsize=4, nvalign=4] 
           271:  
           272: *** Dumping AST Record Layout 
           273:          0 | struct DV 
label:419'0                           X error: no match found
           274:          0 |   struct BV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
label:419'1              ?                               possible intended match
           275:          0 |     struct AV (primary base) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           276:          0 |       (AV vftable pointer) 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           277:            | [sizeof=4, align=4, 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           278:            |  nvsize=4, nvalign=4] 
label:419'0     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
           279:  
label:419'0     ~
           280: *** Dum
label:419'0     ~~~~~~~
>>>>>>

--

********************
Testing:  0.. 10.. 20.. 30.. 40.. 50.. 60.. 70.. 80.. 90..
FAIL: Clang :: Sema/unbounded-array-bounds.c (22985 of 23032)
******************** TEST 'Clang :: Sema/unbounded-array-bounds.c' FAILED ********************
Exit Code: 134

Command Output (stderr):
--
RUN: at line 1: /root/llvm-project/build/bin/clang -cc1 -internal-isystem /root/llvm-project/build/lib/clang/19/include -nostdsysteminc -triple x86_64-pc-linux-gnu -fsyntax-only -Wno-unused -verify=addr64,expected /root/llvm-project/clang/test/Sema/unbounded-array-bounds.c
